In [5]:
import os 
import pandas as pd
os.getcwd()

'/Users/vlovegreen'

In [10]:
file = "/Users/vlovegreen/Desktop/BIA385/Data - Single Worksheet.xlsx"

In [12]:
data = pd.ExcelFile(file)
type(data)
print(data)

<pandas.io.excel._base.ExcelFile object at 0x126befc70>

In [18]:
print(data.sheet_names)

dataFrame = data.parse('Data')
type(dataFrame)
dataFrame.head()

['Data']

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [22]:
#another way but only has access to first sheet / if you dont do the sheet parameter
file1 = pd.read_excel('/Users/vlovegreen/Desktop/BIA385/Data - Multiple Worksheets.xlsx', sheet_name = 'Data 2' )
file1.head()

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

In [28]:
#only getting certain columns
newData = pd.DataFrame(file1, columns = ['Last Name', 'Gender','City'])
newData.head()

  Last Name Gender           City
0     Power      F        Raleigh
1  Prescott      F   Philadelphia
2   Donaldo      M         Bangor
3   Stiller      M  San Francisco
4    Jieber      F         Austin